"""
变量：容器
弱语言:变量声明的时候对数据类型不是很严格
基本的数据类型
int
floot
string
boolean123
"""
# type() print() input()属于一个内置函数
# 变量的覆盖 后定义的变量会覆盖前面的变量,变量会覆盖
#
# name = 'puchen'
# age = 15
# hight = 159.6
# print(hight)
# print(age+hight)
# print(age)
# print(type(name))  #<class 'str'>
# message = '''
#            这首诗写的是在寂静的月夜思念家乡的感受。诗的前两句，是写诗人在作客他乡的特定环境中一刹那间所产生的错觉。一个独处他乡的人，白天奔波忙碌，倒还能冲淡离愁，然而一到夜深人静的时候，心头就难免泛起阵阵思念故乡的波澜。何况是在月明之夜，更何况是月色如霜的秋夜。“疑是地上霜”中的“疑”字，生动地表达了诗人睡梦初醒，迷离恍惚中将照射在床前的清冷月光误作铺在地面的浓霜。而“霜”字用得更妙，既形容了月光的皎洁，又表达了季节的寒冷，还烘托出诗人飘泊他乡的孤寂凄凉之情。
#         诗的后两句，则是通过动作神态的刻画，深化思乡之情。“望”字照应了前句的... 古诗文网>>
#         这是写远客思乡之情的诗，诗以明白如话的语言雕琢出明静醉人的秋夜的意境。它不追求想象的新颖奇特，也摒弃了辞藻的精工华美；它以清新朴素的笔触，抒写了丰富深曲的内容。境是境，情是情，那么逼真，那么动人，百读不厌，耐人寻绎。无怪乎有人赞它是“妙绝古今”。 诗词名句网>>
#       '''
# print('puchen说："今天吃的很饱！"')
# print("puchen说：'今天吃的很饱！'")
# print(message)
# # 用于判断变量,eg:是否登录成功
# bol = False or True
# net = True
# print(bol)
# print(1)
#
#
# input = input('请输入:')  #会阻塞进程
# print(input)


